'use client';

import { useEffect, useRef, useState } from 'react';
import Container from '@/components/UI/Container';
import Text from '@/components/UI/Text';
import Collapse2 from '../UI/Collapse2';

const KEYWORD_POOL_BLOCKS: { title: string; description: string }[] = [
	{
		title: 'چرا اتراکس؟',
		description:
			'صرافی اتراکس، با تکیه بر دانش فنی روز و دارا بودن تیمی متخصص، محیطی امن و شفاف را برای تمام نیازهای کاربران در زمینه ارز دیجیتالی را فراهم کرده است. از خرید ارز دیجیتال گرفته تا فروش ارز دیجیتال و نمودارهای تریدینگ ویو، همه چیز در دسترس شماست. اتراکس به عنوان یکی از معتبرترین صرافی های ارز دیجیتال در ایران، همیشه در تلاش است تا با ارائه کردن قیمت لحظه‌ای ارز دیجیتال و پشتیبانی از طیف گسترده‌ای از ارزهای دیجیتال معروف و محبوب مانند بیت‌کوین (BTC)، اتریوم (ETH)، تتر (USDT)، ترون (TRX)، شیبا (SHIB)، کیک (CAKE)، سولانا (SOL)، پپه (PEPE)، فت (FET)، چیلیز (CHZ)، ای سی پی (ICP)، کارتسی (CTSI) و صدها ارز دیجیتال دیگر نیازهای متنوع کاربران را برآورده سازد.\n\nهمچنین پلتفرم ما از طریق برنامه خرید و فروش آنلاین ارز دیجیتال و اپلیکیشن اتراکس خرید ارز دیجیتال در دسترس شما عزیزان قرار دارد و با ارائه قیمت لحظه‌ای روز ارزها، یک صرافی آنلاین ارز دیجیتال قابل‌اعتماد برای کاربران ایرانی محسوب می‌شود.',
	},
	{
		title: 'خدمات جامع و پشتیبانی حرفه‌ای در اتراکس',
		description:
			'در بخش آموزش ارزهای دیجیتال، می‌توانید از آموزش‌های صفر تا صد درباره خرید، فروش و ترید رمزارز در سری مقالات اتراکس بهره‌مند شوید. این آموزش‌ها شامل تحلیل تکنیکال، نحوه استفاده از کیف پول‌ کریپتوکارنسی از جمله تراست ولت (Trust Wallet)، کیف پول ارز دیجیتال ایرانی و روش‌های تبدیل ارز دیجیتال به ریال و تومان است.\n\nچه به دنبال آموزش ترید ارز دیجیتال با گوشی باشید و چه قصد سرمایه گذاری در ارز دیجیتال با پول کم را داشته باشید، اتراکس در این مسیر با شماست و سعی بر آن دارد که مسیر را برایتان هموار سازد. همچنین، برای آن دسته از کاربرانی که به دنبال کسب اطلاعات درباره ایردراپ‌های معتبر و یا ایردراپ تتر رایگان تلگرام هستند، راهنمایی‌های لازم ارائه شده است. ما می‌دانیم که سوالاتی مانند "آیا استخراج بیت کوین قانونی است؟" برای کاربران ایرانی بسیار حائز اهمیت است، به همین دلیل اطلاعات دقیق و به‌روزی در زمینه قوانین ارز دیجیتال در ایران به کاربران ارائه می‌کنیم.',
	},
	{
		title: 'ابزارهای پیشرفته برای تریدینگ موفق',
		description:
			'اتراکس، علاوه بر خدمات خرید و فروش، به‌عنوان یک صرافی ایرانی معتبر با رابط کاربری آسان و سیستم احراز هویت سریع و دارای احراز هویت دوعاملی شناخته می‌شود. برای کاربرانی که به دنبال صرافی خرید ارز دیجیتال بدون احراز هویت هستند، بخش OTC و خرید آنلاین ارز دیجیتال با کارت بانکی در نظر گرفته شده است.\n\nبا استفاده از پلتفرم صرافی آنلاین اتراکس، شما به ابزارهای قدرتمند و هوشمندی برای ترید بیت کوین و سایر ارزهای دیجیتال دسترسی خواهید داشت. امکان مشاهده نمودار قیمت بیت کوین در یک سال، دسترسی به سیگنال ارز دیجیتال رایگان تلگرام و استفاده از ربات ترید برای معاملات ارز دیجیتال، فقط بخش کوچکی از امکانات ماست. تبدیل تتر به تومان و تبدیل بیت کوین به تومان به سادگی و با سرعت بالا انجام می‌شود. همچنین، اطلاعات کاملی در خصوص کیف پول ارز دیجیتال و بهترین گزینه‌ها مانند کیف پول تراست ولت در اختیار شما قرار می‌گیرد. اتراکس به عنوان صرافی انتخابی شما، تمام تلاش خود را می‌کند تا تجربه شما از خرید و فروش رمز ارز، آسان و سودآور باشد.',
	},
	{
		title: 'کنترل کامل دارایی‌های دیجیتال با اتراکس',
		description:
			'در بازار ارزهای دیجیتال پر از نوسان، انتخاب یک صرافی معتبر که علاوه بر داشتن امنیتی قابل اعتماد، امکاناتی برای رشد و توسعه سرمایه کاربران نیز فراهم کند، اهمیت زیادی دارد.\n\nاگر هنوز نمی‌دانید از کجا ارز بخرید، اتراکس به شما پاسخ روشنی می‌دهد: معتبرترین صرافی ارز دیجیتال در ایران با امنیت بالا، پشتیبانی قوی و تجربه‌ای حرفه‌ای حتی در روزهای پر تنش.\n\nما در اتراکس به تمام نیازهای شما پاسخ می‌دهیم؛ در قسمت آموزش صرافی اتراکس، از آموزش فارکس و ارز دیجیتال گرفته تا ربات تریدر، برنامه خرید و فروش دلار، بررسی حجم معاملات ارزهای دیجیتال و حتی مقایسه با بهترین صرافی‌های خارجی برای ایرانیان به زبان ساده آموزش داده شده است.',
	},
	{
		title: 'ثبت نام در صرافی با هدیه ثبت نام',
		description:
			'با ثبت نام در صرافی اتراکس، می‌توانید نسبت به دریافت ارز دیجیتال رایگان اقدام کنید؛ صرافی جایزه دار اتراکس، به ازای ثبت نام در صرافی ارز دیجیتال رایگان به شما ارائه می‌کند. اتراکس علاوه بر قرار گرفتن در زمره صرافی ارز دیجیتال با جایزه و صرافی هایی که ارز رایگان میدهند با انجام مراحل احراز هویت نیز، هدیه احراز هویت در صرافی ایرانی اتراکس را به شما ارائه می‌کند.\n\nبا اتراکس، مسیر ورود به بازار کریپتو هموارتر از همیشه است. همین حالا در صفحه ثبت‌نام اتراکس، حساب کاربری خود را ایجاد کنید، سپس حساب خود را شارژ کرده و بهترین ارز دیجیتال برای سرمایه‌گذاری روزانه را با کمترین کارمزد خریداری کنید. اگر به دنبال معتبرترین صرافی برای ترید هستید، اتراکس با قدرت در کنار شماست. ما تنها یک سایت خرید و فروش ارز دیجیتال نیستیم، بلکه شریک شما در مسیر رشد و موفقیت در دنیای ارز دیجیتال هستیم.',
	},
];

export default function KeywordPool() {
	const [isOpen, setIsOpen] = useState(false);
	const [height, setHeight] = useState<number | string>(0);
	const contentRef = useRef<HTMLDivElement>(null);

	useEffect(() => {
		if (contentRef.current) {
			if (isOpen) {
				setHeight(contentRef.current.scrollHeight);
			} else {
				setHeight(0);
			}
		}
	}, [isOpen]);

	useEffect(() => {
		if (isOpen && contentRef.current) {
			const resizeObserver = new ResizeObserver(() => {
				if (contentRef.current) {
					setHeight(contentRef.current.scrollHeight);
				}
			});
			resizeObserver.observe(contentRef.current);
			return () => resizeObserver.disconnect();
		}
	}, [isOpen]);

	const toggle = () => {
		setIsOpen((prev) => !prev);
	};

	return (
		<Container className={'w-full mb-40'}>
			<div className="space-y-2">
				<Text
					variant="Main/16px/Regular"
					gradient="primary"
					className="block font-bold"
				>
					اتراکس: دروازه ایمن شما به دنیای ارزهای دیجیتال
				</Text>
				<Text
					variant="LongText/14px/Regular"
					className="text-grayscale-06! whitespace-pre-line"
				>
					صرافی اتراکس به عنوان یک صرافی ایرانی ارز دیجیتال معتبر و پیشرو در
					حوزه بازار ارز دیجیتال ایران، با هدف ارائه بستری امن، سریع و کاربرمحور
					راه‌اندازی شده است. ما با تکیه بر فناوری‌های نوین و پشتیبانی ۲۴ ساعته،
					امکان خرید و فروش امن ارز دیجیتال را برای کاربران خود فراهم کرده‌ایم
					تا تجربه‌ای بی‌نظیر از ورود به این بازار هیجان‌انگیز را برایتان رقم
					بزنیم.
				</Text>
			</div>

			{/* Content */}
			<div
				id="collapse-content"
				className="overflow-hidden transition-all duration-300 ease-in-out mt-6"
				style={{
					height: typeof height === 'number' ? `${height}px` : height,
					opacity: isOpen ? 1 : 0,
				}}
			>
				<div ref={contentRef} className={'flex flex-col gap-6'}>
					{KEYWORD_POOL_BLOCKS.map((block, index) => (
						<div key={index} className="space-y-2">
							<Text
								variant="Main/16px/Regular"
								gradient="primary"
								className="block font-bold"
							>
								{block.title}
							</Text>
							<Text
								variant="LongText/14px/Regular"
								className="text-grayscale-06! whitespace-pre-line"
							>
								{block.description}
							</Text>
						</div>
					))}
				</div>
			</div>
			{/* Trigger */}
			<button
				type="button"
				onClick={toggle}
				className="mt-4 text-brand-primary focus:outline-none "
				aria-expanded={isOpen}
				aria-controls="collapse-content"
			>
				<Text variant="Main/14px/Bold" className="block">
					{isOpen ? 'نمایش کمتر' : 'نمایش بیشتر'}
				</Text>
			</button>
		</Container>
	);
}
